app/views/doc7s/index.html.erb

<br />
<% if Doc7.where(tender_id: @tender.id).count == 0%>
---
SELECT `doc7s`.* FROM `doc7s` WHERE `doc7s`.`tender_id` = 5
SELECT COUNT(*) FROM `doc7s` WHERE `doc7s`.`tender_id` = 5