app/views/doc5s/index.html.erb

SELECT `doc5s`.* FROM `doc5s` WHERE `doc5s`.`tender_id` = 2
SELECT COUNT(*) FROM `doc5s` WHERE `doc5s`.`tender_id` = 2
---
<br />
<% if Doc5.where(tender_id: @tender.id).count == 0%>