app/views/doc10s/index.html.erb

SELECT `doc10s`.* FROM `doc10s` WHERE `doc10s`.`tender_id` = 6
SELECT COUNT(*) FROM `doc10s` WHERE `doc10s`.`tender_id` = 6
---
<br />
<% if Doc10.where(tender_id: @tender.id).count == 0%>