app/views/doc9s/index.html.erb

SELECT `doc9s`.* FROM `doc9s` WHERE `doc9s`.`tender_id` = 5
---
<br />
<% if Doc9.where(tender_id: @tender.id).count == 0%>