app/views/doc2s/index.html.erb

<br />
<% if Doc2.where(tender_id: @tender.id).count == 0%>
---
SELECT `doc2s`.* FROM `doc2s` WHERE `doc2s`.`tender_id` = 6
SELECT COUNT(*) FROM `doc2s` WHERE `doc2s`.`tender_id` = 6