app/controllers/conversations_controller.rb

SELECT `conversations`.* FROM `conversations`
---
  def index
    @conversations = Conversation.all

INSERT INTO `conversations` (`title`, `body`, `sender_id`, `receiver_id`, `type_of_message`, `created_at`, `updated_at`) VALUES ('Hello Message', 'Hello', 9, 10, 3, '2020-01-13 19:44:45.445360', '2020-01-13 19:44:45.445360')
---
  def create
    @conversation = Conversation.new(conversation_params)
    @conversation.sender_id = current_user.id
    respond_to do |format|
      if @conversation.save

UPDATE `conversations` SET `conversations`.`type_of_message` = 0, `conversations`.`remark` = 'Okay', `conversations`.`updated_at` = '2020-01-14 14:43:59.495539' WHERE `conversations`.`id` = 3
---
  def update
    respond_to do |format|
      if @conversation.update(conversation_params)

SELECT `conversations`.* FROM `conversations` WHERE `conversations`.`id` = 1 LIMIT 1
---
    def set_conversation
      @conversation = Conversation.find(params[:id])