app/controllers/doc1s_controller.rb

UPDATE `doc1s` SET `doc1s`.`item_name` = '122qwq', `doc1s`.`updated_at` = '2020-01-01 19:59:51.523992' WHERE `doc1s`.`id` = 14
---
  def update
    if @tender.locked?
      @doc1.locked!
    else
      if @doc1.update_attributes(doc1_params)

SELECT `tenders`.* FROM `tenders` WHERE `tenders`.`id` = 22 LIMIT 1  [["id", 22], ["LIMIT", 1]]
---
    def set_tender
      @tender = Tender.find(params[:tender_id])

SELECT `doc1s`.* FROM `doc1s` WHERE `doc1s`.`tender_id` = 23 AND `doc1s`.`id` = 14 LIMIT 1
---
    def set_doc1
      @doc1 = @tender.doc1s.find(params[:id])