app/controllers/doc10s_controller.rb

INSERT INTO `doc10s` (`tender_id`, `created_at`, `updated_at`) VALUES (6, '2020-02-16 15:20:13.712520', '2020-02-16 15:20:13.712520')
---
  def create
    @doc10 = @tender.doc10s.build(doc10_params)

    if @doc10.save

DELETE FROM `doc10s` WHERE `doc10s`.`id` = 1
---
  def destroy
    @doc10.destroy

SELECT `tenders`.* FROM `tenders` WHERE `tenders`.`id` = 6 LIMIT 1
---
    def set_tender
      @tender = Tender.find(params[:tender_id])

SELECT `doc10s`.* FROM `doc10s` WHERE `doc10s`.`tender_id` = 6 AND `doc10s`.`id` = 1 LIMIT 1
---
    def set_doc10
      @doc10 = @tender.doc10s.find(params[:id])