app/controllers/doc2s_controller.rb

INSERT INTO `doc2s` (`tender_id`, `created_at`, `updated_at`) VALUES (6, '2020-02-16 15:40:00.494047', '2020-02-16 15:40:00.494047')
---
  def create
    @doc2 = @tender.doc2s.build(doc2_params)

    if @doc2.save

DELETE FROM `doc2s` WHERE `doc2s`.`id` = 1
---
  def destroy
    @doc2.destroy

SELECT `tenders`.* FROM `tenders` WHERE `tenders`.`id` = 6 LIMIT 1
---
    def set_tender
      @tender = Tender.find(params[:tender_id])

SELECT `doc2s`.* FROM `doc2s` WHERE `doc2s`.`tender_id` = 6 AND `doc2s`.`id` = 1 LIMIT 1
---
    def set_doc2
      @doc2 = @tender.doc2s.find(params[:id])