app/controllers/doc5s_controller.rb

  def create
    @doc5 = @tender.doc5s.build(doc5_params)

    if @doc5.save
---
INSERT INTO `doc5s` (`tender_id`, `created_at`, `updated_at`) VALUES (2, '2020-02-16 13:23:19.292409', '2020-02-16 13:23:19.292409')

  def destroy
    @doc5.destroy
---
DELETE FROM `doc5s` WHERE `doc5s`.`id` = 1

    def set_tender
      @tender = Tender.find(params[:tender_id])
---
SELECT `tenders`.* FROM `tenders` WHERE `tenders`.`id` = 2 LIMIT 1

    def set_doc5
      @doc5 = @tender.doc5s.find(params[:id])
---
SELECT `doc5s`.* FROM `doc5s` WHERE `doc5s`.`tender_id` = 2 AND `doc5s`.`id` = 1 LIMIT 1