app/controllers/doc6s_controller.rb

INSERT INTO `doc6s` (`tender_id`, `number_bids_received`, `number_bidder_representative`, `number_of_bids_accepted`, `name_of_accepted_firms`, `number_of_bids_rejected`, `name_of_rejected_firms`, `date_of_financial_bid_opening`, `created_at`, `updated_at`) VALUES (3, 10, 20, 15, 'Hello', 15, 'Hello', '2020-02-16', '2020-02-16 14:02:55.373394', '2020-02-16 14:02:55.373394')
---
  def create
    @doc6 = @tender.doc6s.build(doc6_params)

    if @doc6.save

DELETE FROM `doc6s` WHERE `doc6s`.`id` = 1
---
  def destroy
    @doc6.destroy

SELECT `tenders`.* FROM `tenders` WHERE `tenders`.`id` = 1 LIMIT 1
---
    def set_tender
      @tender = Tender.find(params[:tender_id])

SELECT `doc6s`.* FROM `doc6s` WHERE `doc6s`.`tender_id` = 3 AND `doc6s`.`id` = 1 LIMIT 1
---
    def set_doc6
      @doc6 = @tender.doc6s.find(params[:id])