app/controllers/doc7s_controller.rb

INSERT INTO `doc7s` (`tender_id`, `created_at`, `updated_at`) VALUES (5, '2020-02-16 14:50:22.463534', '2020-02-16 14:50:22.463534')
---
  def create
    @doc7 = @tender.doc7s.build(doc7_params)

    if @doc7.save

SELECT `tenders`.* FROM `tenders` WHERE `tenders`.`id` = 5 LIMIT 1
---
    def set_tender
      @tender = Tender.find(params[:tender_id])

SELECT `doc7s`.* FROM `doc7s` WHERE `doc7s`.`tender_id` = 5 AND `doc7s`.`id` = 1 LIMIT 1
---
    def set_doc7
      @doc7 = @tender.doc7s.find(params[:id])