app/controllers/doc9s_controller.rb

INSERT INTO `doc9s` (`tender_id`, `created_at`, `updated_at`) VALUES (5, '2020-02-16 15:08:01.652930', '2020-02-16 15:08:01.652930')
---
  def create
    @doc9 = @tender.doc9s.build(doc9_params)

    if @doc9.save

SELECT `tenders`.* FROM `tenders` WHERE `tenders`.`id` = 5 LIMIT 1
---
    def set_tender
      @tender = Tender.find(params[:tender_id])

SELECT `doc9s`.* FROM `doc9s` WHERE `doc9s`.`tender_id` = 5 AND `doc9s`.`id` = 1 LIMIT 1
---
    def set_doc9
      @doc9 = @tender.doc9s.find(params[:id])