app/controllers/tenders_controller.rb

  def index
    @tenders = Tender.all
---
SELECT `tenders`.* FROM `tenders`

  def create
    @tender = Tender.new(tender_params)
    @tender.user_id = current_user.id
    respond_to do |format|
      if @tender.save
---
INSERT INTO `tenders` (`title`, `body`, `created_at`, `updated_at`, `user_id`) VALUES ('This is my tender', 'Trying new', '2019-12-24 13:34:33.061392', '2019-12-24 13:34:33.061392', 8)

  def update
    respond_to do |format|
      if @tender.update(tender_params)
---
UPDATE `tenders` SET `tenders`.`body` = 'saasas1', `tenders`.`updated_at` = '2020-01-01 19:25:31.980802' WHERE `tenders`.`id` = 15

    def set_tender
      @tender = Tender.find(params[:id])
---
SELECT `tenders`.* FROM `tenders` WHERE `tenders`.`id` = 15 LIMIT 1  [["id", 15], ["LIMIT", 1]]

    def dept
      User.where(id: @tender.user_id).pluck(:department).join
---
SELECT `users`.`department` FROM `users` WHERE `users`.`id` = 7

    def generate_ref_id
      @tender.ref_id="NITK/#{dept()}/FUND_TYPE/#{yeara()}/#{srno()}/"
      @tender.save!
---
UPDATE `tenders` SET `tenders`.`updated_at` = '2020-01-01 18:42:39.270846', `tenders`.`ref_id` = 'NITK/MAs/FUND_TYPE/2020/0/' WHERE `tenders`.`id` = 20