app/controllers/tenders_controller.rb

  def destroy
    @tender.destroy
---
DELETE FROM `tenders` WHERE `tenders`.`id` = 18