app/views/doc6s/index.html.erb

SELECT `doc6s`.* FROM `doc6s` WHERE `doc6s`.`tender_id` = 1
SELECT COUNT(*) FROM `doc6s` WHERE `doc6s`.`tender_id` = 3
---
<br />
<% if Doc6.where(tender_id: @tender.id).count == 0%>